Revit 2027 API
SlabShapeCrease Properties
The SlabShapeCrease type exposes the following members.
Properties
Name | Description
CreaseType |  The type of the crease.
Curve | The geometry of the crease.
EndPoints | The vertices of the crease.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
SlabShapeCrease Class
Autodesk.Revit.DB Namespace